import { Temporal } from "temporal-polyfill";

export interface SimpleTransaction {
  date: string; // 어떤 포맷일까?
  description: string; // 몇 자까지 가능할까?
  postings: {
    account: string; // 올바른 종류는 무엇이 있을까?
    amount: number; // 0 이상, 0 이하일 수도 있을까?
    commodity: string; // 'KRW' 말고 다른 것도 있을까? 어떻게 알지?
  }[];
  tags: string[]; // 몇 개까지 가능할까? 미리 지정된 것만 가능한가?
}

type Brand<K, T> = K & { __brand: T };

export const ACCOUNT_LIST = [
  "자본:출자금",
  "자산:현금",
  "자산:유동자산:당좌자산:현금및현금성자산",
  "자산:유동자산:당좌자산:현금및현금성자산:현금",
  "자산:유동자산:당좌자산:현금및현금성자산:보통예금",
  "자산:유동자산:당좌자산:단기투자자산",
  "자산:유동자산:당좌자산:단기투자자산:정기예금",
  "자산:유동자산:당좌자산:매출채권",
  "자산:유동자산:당좌자산:매출채권:(-)대손충당금", // type: A
  "자산:유동자산:당좌자산:선급비용",
  "자산:유동자산:당좌자산:미수수익",
  "자산:유동자산:당좌자산:미수금",
  "자산:유동자산:당좌자산:미수금:(-)대손충당금", // type:A
  "자산:유동자산:당좌자상인선급금",
  "자산:유동자산:당좌자산:선납세금(부가세)",
  "자산:유동자산:당좌자산:유가증권",
  "자산:유동자산:재고자산",
  "자산:비유동자산:투자자산:장기성예금",
  "자산:비유동자산:투자자산:투자유가증권",
  "자산:비유동자산:투자자산:장기대여금",
  "자산:비유동자산:투자자산:수익사업출자금",
  "자산:비유동자산:유형자산:토지",
  "자산:비유동자산:유형자산:토지:(-)감가상각누계액",
  "자산:비유동자산:유형자산:건물",
  "자산:비유동자산:유형자산:건물:(-)감가상각누계액",
  "자산:비유동자산:유형자산:구축물",
  "자산:비유동자산:유형자산:구축물:(-)감가상각누계액",
  "자산:비유동자산:유형자산:기계장치",
  "자산:비유동자산:유형자산:기계장치:(-)감가상각누계액",
  "자산:비유동자산:유형자산:차량운반구",
  "자산:비유동자산:유형자산:차량운반구:(-)감가상각누계액",
  "자산:비유동자산:유형자산:건설중인자산",
  "자산:비유동자산:유형자산:건설중인자산:(-)감가상각누계액",
  "자산:비유동자산:무형자산:지식재산권",
  "자산:비유동자산:무형자산:개발비",
  "자산:비유동자산:무형자산:컴퓨터소프트웨어",
  "자산:비유동자산:무형자산:광업권",
  "자산:비유동자산:무형자산:임차권리금",
  "자산:비유동자산:기타비유동자산:임차보증금",
  "자산:비유동자산:기타비유동자산:장기선급비용",
  "자산:비유동자산:기타비유동자산:장기미수금",
  "부채:유동부채:단기차입금",
  "부채:유동부채:매입채무",
  "부채:유동부채:미지급비용",
  "부채:유동부채:미지급금",
  "부채:유동부채:미지급세금",
  "부채:유동부채:선수금",
  "부채:유동부채:선수수익",
  "부채:유동부채:예수금",
  "부채:유동부채:예수금:부가세예수금(수익사업매출)",
  "부채:유동부채:유동성장기부채",
  "부채:비유동부채:장기차입금",
  "부채:비유동부채:임대보증금",
  "부채:비유동부채:퇴직급여충당부채",
  "부채:비유동부채:퇴직급여충당부채:(-)퇴직연금운용자산",
  "순자산:기본순자산",
  "순자산:보통순자산",
  "순자산:보통순자산:잉여금",
  "사업수익:고유목적사업수익:기부금수익",
  "사업수익:고유목적사업수익:정부보조금수익",
  "사업수익:고유목적사업수익:회비수익",
  "사업수익:고유목적사업수익:출자금",
  "사업수익:수익사업수익:대형행사후원사모집수익",
  "사업수익:수익사업수익:유료행사수익",
  "사업수익:수익사업수익:기념품판매수익",
  "사업수익:수익사업수익:기타",
  "사업비용:사업수행비용:인력비용:급여",
  "사업비용:사업수행비용:인력비용:상여금",
  "사업비용:사업수행비용:인력비용:퇴직급여",
  "사업비용:사업수행비용:인력비용:복리후생비",
  "사업비용:사업수행비용:인력비용:교육훈련비",
  "사업비용:사업수행비용:시설비용:감가상각비",
  "사업비용:사업수행비용:시설비용:지급임차료",
  "사업비용:사업수행비용:시설비용:시설보험료",
  "사업비용:사업수행비용:시설비용:시설유지관리비",
  "사업비용:사업수행비용:기타비용:여비교통비",
  "사업비용:사업수행비용:기타비용:소모품비",
  "사업비용:사업수행비용:기타비용:수도광열비",
  "사업비용:사업수행비용:기타비용:제세공과금",
  "사업비용:사업수행비용:기타비용:지급수수료",
  "사업비용:사업수행비용:기타비용:용역비",
  "사업비용:사업수행비용:기타비용:업무추진비",
  "사업비용:사업수행비용:기타비용:회의비",
  "사업비용:사업수행비용:기타비용:광고선전비",
  "사업비용:사업수행비용:기타비용:운반비",
  "사업비용:사업수행비용:기타비용:대손상각비",
  "사업비용:사업수행비용:기타비용:도서인쇄비",
  "사업비용:일반관리비용:인력비용:급여",
  "사업비용:일반관리비용:인력비용:상여금",
  "사업비용:일반관리비용:인력비용:퇴직급여",
  "사업비용:일반관리비용:인력비용:복리후생비",
  "사업비용:일반관리비용:인력비용:교육훈련비",
  "사업비용:일반관리비용:시설비용:감가상각비",
  "사업비용:일반관리비용:시설비용:지급임차료",
  "사업비용:일반관리비용:시설비용:시설보험료",
  "사업비용:일반관리비용:시설비용:시설유지관리비",
  "사업비용:일반관리비용:기타비용:여비교통비",
  "사업비용:일반관리비용:기타비용:소모품비",
  "사업비용:일반관리비용:기타비용:수도광열비",
  "사업비용:일반관리비용:기타비용:제세공과금",
  "사업비용:일반관리비용:기타비용:지급수수료",
  "사업비용:일반관리비용:기타비용:용역비",
  "사업비용:일반관리비용:기타비용:업무추진비",
  "사업비용:일반관리비용:기타비용:회의비",
  "사업비용:일반관리비용:기타비용:광고선전비",
  "사업비용:일반관리비용:기타비용:운반비",
  "사업비용:일반관리비용:기타비용:대손상각비",
  "사업비용:일반관리비용:기타비용:세금과공과",
  "사업비용:일반관리비용:기타비용:법인세등",
  "사업외수익:고유목적사업환입액",
  "사업외수익:이자수익",
  "사업외수익:배당수익",
  "사업외수익:기타수익",
  "사업외수익:투자자산평가이익",
  "사업외수익:투자자산처분이익",
  "사업외수익:유형자산손상차손환입",
  "사업외수익:무형자산손상차손환입",
  "사업외수익:유형자산처분이익",
  "사업외수익:무형자산처분이익",
  "사업외수익:전기오류수정이익",
  "사업외수익:잡이익",
  "사업외비용:이자비용",
  "사업외비용:투자자산평가손실",
  "사업외비용:투자자산처분손실",
  "사업외비용:유형자산손상차손",
  "사업외비용:무형자산손상차손",
  "사업외비용:유형자산처분손실",
  "사업외비용:무형자산처분손실",
  "사업외비용:고유목적사업비",
  "사업외비용:잡손실",
] as const;
export type Account = (typeof ACCOUNT_LIST)[number]; // ...
export const COMMODITY_LIST = ["KRW"] as const;
export type Commodity = "KRW";

export type ValidTransaction = Brand<
  {
    date: Temporal.PlainDate;
    description: string;
    postings: {
      account: Account;
      amount: number;
      commodity: Commodity;
    }[];
    tags: string[];
  },
  "ValidTransaction"
>;


export const ACCOUNT_TYPE_LIST = ["자본", "자산", "부채", "사업수익", "사업비용", "사업외수익", "사업외비용"] as const;
export type AccountType = (typeof ACCOUNT_TYPE_LIST)[number];
